uhnp/src/Documents/ЗапросДанныхНалоговогоМониторинга/ЗапросДанныхНалоговогоМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросДанныхНалоговогоМониторинга</name>
  <attributes>
    <name>Глава</name>
    <type>
      <types>CatalogRef.УдалитьГлавыНалоговогоКодексаНалоговогоМониторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ОснованияДляЗапросаНалоговогоМониторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>СутьЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПеречняДокументов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметЗапроса</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОтчетаКНД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СутьЗапросаФорматированная</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьФорматированиеСутиЗапроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьДокументов</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ПолучателиОповещенийОЗапросахНалоговогоМониторинга/ПолучателиОповещенийОЗапросахНалоговогоМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолучателиОповещенийОЗапросахНалоговогоМониторинга</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КатегорииСобытийОповещений/КатегорииСобытийОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииСобытийОповещений</name>
  <predefined>
    <items>
      <name>Напоминания</name>
      <description>Напоминания</description>
    </items>
    <items>
      <name>Ошибки</name>
      <description>Оповещения для администратора инф. базы</description>
    </items>
    <items>
      <name>ОповещенияЭтапаПроцесса</name>
      <description>Оповещения этапов процесса</description>
    </items>
    <items>
      <name>ОценкаАльтернатив</name>
      <description>Оценка альтернатив</description>
    </items>
    <items>
      <name>ПотребностьВРесурсахЗакупок</name>
      <description>Потребность в ресурсах закупок</description>
    </items>
    <items>
      <name>СобытияВыполненияПроцесса</name>
      <description>Процесс - общие события процессов</description>
    </items>
    <items>
      <name>СобытияСогласования</name>
      <description>Процесс - события согласования</description>
    </items>
    <items>
      <name>СобытияЭтапаОбработка</name>
      <description>Процесс - этап &quot;Обработка&quot;</description>
    </items>
    <items>
      <name>СобытияЭтапаРучнойПереход</name>
      <description>Процесс - этап &quot;Переход по выбору&quot;</description>
    </items>
    <items>
      <name>СобытияПроцессаПодготовкиОтчетности</name>
      <description>Процесс - этап &quot;Подготовка отчетности&quot;</description>
    </items>
    <items>
      <name>СобытияГПЗ</name>
      <description>События годовой программы закупок</description>
    </items>
    <items>
      <name>СобытияМонитораКлючевыхПоказателей</name>
      <description>События монитора ключевых показателей</description>
    </items>
    <items>
      <name>АккредитацияПоставщиков</name>
      <description>События по аккредитации поставщиков</description>
    </items>
    <items>
      <name>СобытияДоговоров</name>
      <description>События по договорам</description>
    </items>
    <items>
      <name>ОплатаЗаявок</name>
      <description>События по заявкам на оплату</description>
    </items>
    <items>
      <name>СобытияПоКорректировкамЛимитов</name>
      <description>События по корректировкам лимитов</description>
    </items>
    <items>
      <name>СобытияПоМероприятиям</name>
      <description>События по мероприятиям</description>
    </items>
    <items>
      <name>СобытияПроектов</name>
      <description>События по проектам</description>
    </items>
    <items>
      <name>СобытияПоЭкспертизе</name>
      <description>События по экспертизе</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещаемыеПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСкрытаяКатегория</name>
    <comment>Не отображается пользователям</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Documents/ЗапросДанныхНалоговогоМониторинга/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			ЗаполнитьПоРегОтчету(ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
			ЗаполнитьПоРегОтчету(ДанныеЗаполнения.РегламентированныйОтчет, ДанныеЗаполнения.Раздел, ДанныеЗаполнения.НомерСтроки);
		Иначе 
			
			ЭтотОбъект.ПредметЗапроса = ДанныеЗаполнения;
			
			РеквизитыЗаполнения = Новый Структура("Организация, Дата");
			ЗаполнитьЗначенияСвойств(РеквизитыЗаполнения, ДанныеЗаполнения);
			Если ЗначениеЗаполнено(РеквизитыЗаполнения.Организация) И Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
				ЭтотОбъект.Организация = РеквизитыЗаполнения.Организация;
			КонецЕсли;
			Если ЗначениеЗаполнено(РеквизитыЗаполнения.Дата) Тогда
				ЭтотОбъект.ОкончаниеПериода = КонецМесяца(РеквизитыЗаполнения.Дата);
				ЭтотОбъект.НачалоПериода = НачалоГода(ЭтотОбъект.ОкончаниеПериода);
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(ЭтотОбъект.Организация) И ЗначениеЗаполнено(ЭтотОбъект.Глава) И ЗначениеЗаполнено(ЭтотОбъект.ОкончаниеПериода)) Тогда
		
		Настройки = НалоговыйМониторинг.ПолучитьСтруктуруНастроекПоУмолчанию(КонецДня(ЭтотОбъект.Дата), ЭтотОбъект.Ответственный);
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
			ЭтотОбъект.Организация = Настройки.Организация;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Глава) Тогда
			ЭтотОбъект.Глава = Настройки.ГлаваНК;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОкончаниеПериода) Тогда
			ЭтотОбъект.ОкончаниеПериода = Настройки.ОкончаниеПериода;
			ЭтотОбъект.НачалоПериода = Настройки.НачалоПериода;
		КонецЕсли;
	
	КонецЕсли;
	
	ЭтотОбъект.ПлановаяДатаОтвета = НалоговыйМониторингВызовСервера.ПлановаяДатаОтветаНаЗапросНМ(ТекущаяДата());
	
КонецПроцедуры

Процедура ЗаполнитьПоРегОтчету(РегОтчет, Раздел = Неопределено, НомерСтроки = Неопределено)
	
	ЭтотОбъект.ПредметЗапроса = РегОтчет;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ФормаОтчета) Тогда
		ЭтотОбъект.ФормаОтчета = РегОтчет.НаименованиеОтчета;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ЭтотОбъект.Организация = РегОтчет.Организация;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтотОбъект.Раздел) Тогда
		ЭтотОбъект.Раздел = Раздел;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтотОбъект.НомерСтроки) Тогда
		ЭтотОбъект.НомерСтроки = НомерСтроки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.НачалоПериода) Тогда
		ЭтотОбъект.НачалоПериода = РегОтчет.ДатаНачала;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ОкончаниеПериода) Тогда
		ЭтотОбъект.ОкончаниеПериода = РегОтчет.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеПеречняДокументов = СтрСоединить(ПереченьДокументов.ВыгрузитьКолонку("Документ"), Символы.ПС);
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("МодульУправленияОповещениямиУХ");
		ИмяВидыСобытия = "Справочник.ВидыСобытийОповещений.ЗапросНалоговогоМониторинга";
		ВидСобытия = ПредопределенноеЗначение(ИмяВидыСобытия);
		
		Модуль.УдалитьНапоминанияПоОтбору(Новый Структура("Источник, ВидСобытияОповещения", Ссылка, ВидСобытия));
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") Тогда
		РегистрироватьЗадачиБухгалтера = Константы["АвтоматическаяРегистрацияЗапросаНалоговогоМониторингаВЗадачахБухгалтера"].Получить();
		Если РегистрироватьЗадачиБухгалтера Тогда
			ЗарегистрироватьЗадачу();
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ПроцессыИСогласование") Тогда
		РегистрироватьОпопвещения = Константы["АвтоматическаяРегистрацияЗапросаНалоговогоМониторингаВОповещенияУХ"].Получить();
		Если РегистрироватьОпопвещения Тогда
			ЗарегистрироватьОповещение();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьЗадачу()
	ЗадачиБухгалтера = "ЗадачиБухгалтера";
	Набор = РегистрыСведений[ЗадачиБухгалтера].СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(ЭтотОбъект.Организация);
	Набор.Отбор.Правило.Установить(ЭтотОбъект.Ссылка);
	Запись = Набор.Добавить();
	Запись.Организация = ЭтотОбъект.Организация;
	Запись.Правило = ЭтотОбъект.Ссылка;
	Запись.Наименование = ЭтотОбъект.Ссылка;
	Запись.НаименованиеСокращенное = ЭтотОбъект.Ссылка;
	Запись.ДатаСоздания = ЭтотОбъект.Дата;
	Запись.Срок = ТекущаяДатаСеанса(); //ЭтотОбъект.ПлановаяДатаОтвета;
	Отказ = Ложь;
	НалоговыйМониторингПереопределяемый.ЗарегистрироватьЗадачу(Набор, Отказ);
	Если НЕ Отказ Тогда
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьОповещение()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолучателиОповещенийОЗапросахНалоговогоМониторинга.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.ПолучателиОповещенийОЗапросахНалоговогоМониторинга КАК ПолучателиОповещенийОЗапросахНалоговогоМониторинга";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("МодульУправленияОповещениямиУХ");
		ИмяВидыСобытия = "Справочник.ВидыСобытийОповещений.ЗапросНалоговогоМониторинга";
		ВидСобытия = ПредопределенноеЗначение(ИмяВидыСобытия);
		
		МассивРассылки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
					
		МодульСистемаВзаимодействияСерверУХ = ОбщегоНазначения.ОбщийМодуль("СистемаВзаимодействияСерверУХ");
		БотЗадачИОповещений = МодульСистемаВзаимодействияСерверУХ.ПолучитьПользователяБотаЗадачИОповещений();			
		Если МассивРассылки.Найти(БотЗадачИОповещений) = Неопределено Тогда
			МассивРассылки.Добавить(БотЗадачИОповещений);
		КонецЕсли;
		
		Модуль.ОповеститьПользователей(ВидСобытия, , Ссылка, МассивРассылки);
		КатегорииСобытийОповещенийНапоминания = "Справочник.КатегорииСобытийОповещений.Напоминания";
		
		Если ВидСобытия.КатегорияСобытия = ПредопределенноеЗначение(КатегорииСобытийОповещенийНапоминания) Тогда
			Модуль.СоздатьНапоминание(ВидСобытия, Ссылка, МассивРассылки);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
